Revit 2026 API

# ScheduleDefinitionCanFilter Method

---

Checks whether filters can be added to this ScheduleDefinition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanFilter()
```
```vb
Public Function CanFilter As Boolean
```
```cpp
public:
bool CanFilter()
```
```fsharp
member CanFilter : unit -> bool
```

#### Return Value

Boolean True if this ScheduleDefinition supports filters, false otherwise.

Key schedules and revision schedules do not support filters.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace